<?php


return [
    /*
    |--------------------------------------------------------------------------
    | Failed Messages
    |--------------------------------------------------------------------------
    |
    | The following language lines are the arabic lines which match reasons
    | that in any failed occur in any position in the system
    |
    */

    //===================================================================================
    // ZONES=============================================================================
    //===================================================================================
    'zone.delete.failed' => 'المنطقة قيد الاستخدام',
    'zone.name_ar.required' => 'الرجاء إدخال اسم المنطقة بالعربية',
    'zone.name_ar.max' => 'اسم المنطقة بالعربية طويل جدًا',
    'zone.name_en.required' => 'الرجاء إدخال اسم المنطقة بالإنجليزية',
    'zone.name_en.max' => 'اسم المنطقة بالإنجليزية طويل جدًا',

    //===================================================================================
    // CITES=============================================================================
    //===================================================================================
    'city.delete.failed' => 'المدينة قيد الاستخدام',
    'city.name_ar.required' => 'الرجاء إدخال اسم المدينة بالعربية',
    'city.name_ar.max' => 'اسم المدينة بالعربية طويل جدًا',
    'city.name_en.required' => 'الرجاء إدخال اسم المدينة بالإنجليزية',
    'city.name_en.max' => 'اسم المدينة بالإنجليزية طويل جدًا',
    'city.zone_id.required' => 'الرجاء اختيار منطقة من صندوق الاختيار المخصص للمناطق',

    //===================================================================================
    // CATEGORY TYPE=====================================================================
    //===================================================================================
    'category.type.delete.failed' => 'نوع القسم قيد الاستخدام',
    'category.type.name_ar.required' => 'الرجاء إدخال اسم نوع القسم بالعربية',
    'category.type.name_ar.max' => 'اسم نوع القسم بالعربية طويل جدًا',
    'category.type.name_en.required' => 'الرجاء إدخال اسم نوع القسم بالإنجليزية',
    'category.type.name_en.max' => 'اسم نوع القسم بالإنجليزية طويل جدًا',

    //===================================================================================
    // CATEGORY==========================================================================
    //===================================================================================
    'category.delete.failed' => 'القسم قيد الاستخدام',
    'category.parent_category_id.exists' => 'الرجاء اختيار القسم الرئيسي فقط من صندوق الاختيار المخصص للأفسام',
    'category.name_ar.required' => 'الرجاء إدخال اسم القسم بالعربية',
    'category.name_ar.max' => 'اسم القسم بالعربية طويل جدًا',
    'category.name_en.required' => 'الرجاء إدخال اسم القسم بالإنجليزية',
    'category.name_en.max' => 'اسم القسم بالإنجليزية طويل جدًا',
    'category.category_type_id.required' => 'الرجاء اختيار القسم من صندوق الاختيار المخصص للاقسام',


    //===================================================================================
    // CUSTOMER==========================================================================
    //===================================================================================
    'customer.name.required' => 'الرجاء إدخال اسمك.',
    'customer.name.max' => 'الاسم طويل جدًا',
    'customer.email.required' => 'الرجاء إدخال عنوان البريد الإلكتروني الخاص بك.',
    'customer.email.email' => 'الرجاء إدخال عنوان بريد إلكتروني صالح.',
    'customer.email.unique' => 'هذا البريد الإلكتروني مستخدم بالفعل.',
    'customer.mobile_number.required' => 'الرجاء إدخال رقم هاتفك المحمول.',
    'customer.mobile_number.max' => 'الرجاء إدخال رقم هاتف محمول صالح.',
    'customer.mobile_number.unique' => 'هذا الرقم المحمول مستخدم بالفعل.',
    'customer.password.required' => 'الرجاء إدخال كلمة مرور.',
    'customer.password.min' => 'يجب أن تتألف كلمة المرور من 8 أحرف على الأقل.',
    'customer.password.max' => 'كلمة المرور طويلة جدًا',
    'customer.zone_id.required' => 'الرجاء اختيار منطقة صالحة',
    'customer.city_id.required' => 'الرجاء اختيار مدينة صالحة',
    'customer.platform.required' => 'الرجاء اختيار منصة صالحة',
    'customer.platform.in' => 'الرجاء اختيار منصة صالحة',

];
