<?php


return [
    /*
    |--------------------------------------------------------------------------
    | Failed Messages
    |--------------------------------------------------------------------------
    |
    | The following language lines are the arabic lines which match reasons
    | that in any failed occur in any position in the system
    |
    */

    //===================================================================================
    // ZONES=============================================================================
    //===================================================================================
    'zone.delete.failed' => 'المنطقة قيد الاستخدام',
    'zone.name_ar.required' => 'الرجاء إدخال اسم المنطقة بالعربية',
    'zone.name_ar.max' => 'اسم المنطقة بالعربية طويل جدًا',
    'zone.name_en.required' => 'الرجاء إدخال اسم المنطقة بالإنجليزية',
    'zone.name_en.max' => 'اسم المنطقة بالإنجليزية طويل جدًا',

    //===================================================================================
    // CITES=============================================================================
    //===================================================================================
    'city.delete.failed' => 'المدينة قيد الاستخدام',
    'city.name_ar.required' => 'الرجاء إدخال اسم المدينة بالعربية',
    'city.name_ar.max' => 'اسم المدينة بالعربية طويل جدًا',
    'city.name_en.required' => 'الرجاء إدخال اسم المدينة بالإنجليزية',
    'city.name_en.max' => 'اسم المدينة بالإنجليزية طويل جدًا',
    'city.zone_id.required' => 'الرجاء اختيار منطقة من صندوق الاختيار المخصص للمناطق',
];
