<?php


return [
    /*
    |--------------------------------------------------------------------------
    | Failed Messages
    |--------------------------------------------------------------------------
    |
    | The following language lines are the english lines which match reasons
    | that in any success occur in any position in the system
    |
    */

    //===================================================================================
    // ZONES=============================================================================
    //===================================================================================
    'zone.add.success' => 'تمت إضافة المنطقة بنجاح',
    'zone.edit.success' => 'تم تعديل المنطقة بنجاح',
    'zone.delete.success' => 'تم حذف المنطقة بنجاح',

    //===================================================================================
    // CITIES=============================================================================
    //===================================================================================
    'city.add.success' => 'تمت إضافة المدينة بنجاح',
    'city.edit.success' => 'تم تعديل المدينة بنجاح',
    'city.delete.success' => 'تم حذف المدينة بنجاح',

    //===================================================================================
    // CATEGORY TYPES====================================================================
    //===================================================================================
    'category.type.add.success' => 'تمت إضافة نوع القسم بنجاح',
    'category.type.edit.success' => 'تم تعديل نوع القسم بنجاح',
    'category.type.delete.success' => 'تم حذف نوع القسم بنجاح',

    //===================================================================================
    // CATEGORY==========================================================================
    //===================================================================================
    'category.add.success' => 'تمت إضافة القسم بنجاح',
    'category.edit.success' => 'تم تعديل القسم بنجاح',
    'category.delete.success' => 'تم حذف القسم بنجاح',

    //===================================================================================
    // CUSTOMER==========================================================================
    //===================================================================================
    'customer.add.success' => 'تمت إضافة العميل بنجاح',
    'customer.edit.success' => 'تم تعديل العميل بنجاح',
    'customer.delete.success' => 'تم حذف العميل بنجاح',

    //===================================================================================
    // SERVICE===========================================================================
    //===================================================================================
    'service.add.success' => 'تمت إضافة الخدمة بنجاح',
    'service.edit.success' => 'تم تعديل الخدمة بنجاح',
    'service.delete.success' => 'تم حذف الخدمة بنجاح',

    //===================================================================================
    // ADVERTISEMENTS====================================================================
    //===================================================================================
    'advertisement.add.success' => 'تمت إضافة الاعلان بنجاح',
    'advertisement.edit.success' => 'تم تعديل الاعلان بنجاح',
    'advertisement.delete.success' => 'تم حذف الاعلان بنجاح',
    'advertisement.approve.success' => 'تمت الموافقة على الاعلان بنجاح',

];
