<?php


return [
    /*
    |--------------------------------------------------------------------------
    | Failed Messages
    |--------------------------------------------------------------------------
    |
    | The following language lines are the english lines which match reasons
    | that in any success occur in any position in the system
    |
    */

    //===================================================================================
    // ZONES=============================================================================
    //===================================================================================
    'zone.add.success' => 'تمت إضافة المنطقة بنجاح',
    'zone.edit.success' => 'تم تعديل المنطقة بنجاح',
    'zone.delete.success' => 'تم حذف المنطقة بنجاح',
];
