<?php

return [
    'title' => 'المدن',
    'add.city' => 'إضافة مدينة',
    'name' => 'الاسم',
    'zone' => 'المنطقة',
    'choose' => 'اختر...',
    'name_ar' => 'الاسم بالعربية',
    'name_en' => 'الاسم بالإنجليزية',
    'name.invalid' => 'يرجى إدخال اسم المدينة',
    'close' => 'إغلاق',
    'add' => 'إضافة',
    'edit' => 'تعديل',
    'are.you.sure' => 'هل أنت متأكد؟',
    'not.able.revert' => 'لن تتمكن من التراجع عن هذا!',
    'delete' => 'حذف!',
    'deleted' => 'تم الحذف!',
    'city.add' => 'تمت إضافة المدينة',
    'city.edit' => 'تم تعديل المدينة',
    'city.cannot.delete' => 'لا يمكن حذف المدينة',
    'ok' => 'موافق',
];
