<?php

return [
    'title' => 'الصفحات',
    'add.page' => 'إضافة صفحة',
    'page.add' => 'تم إضافة الصفحة',
    'page.edit' => 'تم تعديل الصفحة',
    'name' => 'اسم الصفحة',
    'add.title' => 'إضافة صفحة جديدة',
    'add.description' => 'إضافة صفحة جديدة من هنا!',
    'edit.description' => 'تعديل صفحة من هنا!',
    'name_ar' => 'الاسم بالعربية',
    'name_en' => 'الاسم بالإنجليزية',
    'name.invalid' => 'الرجاء إدخال الاسم',
    'add' => 'إضافة',
    'content' => 'المحتوى',
    'edit.title' => 'تعديل الصفحة',
    'edit.page' => 'تعديل الصفحة',
    'edit' => 'تعديل',

];
