<?php
return [
    'title' => 'المناطق',
    'add.zone' => 'إضافة منطقة',
    'name' => 'الاسم',
    'action' => 'الإجراء',
    'country' => 'الدولة',
    'name_ar' => 'الاسم بالعربية',
    'name_en' => 'الاسم بالإنجليزية',
    'name.invalid' => 'يرجى إدخال اسم المنطقة',
    'close' => 'إغلاق',
    'edit.zone' => 'تعديل المنطقة',
    'edit' => 'تعديل',
    'are.you.sure' => 'هل أنت متأكد؟',
    'not.able.revert' => 'لن تتمكن من التراجع عن هذا!',
    'delete' => 'حذف!',
    'deleted' => 'تم الحذف!',
    'zone.add' => 'تمت إضافة المنطقة',
    'zone.edit' => 'تم تعديل المنطقة',
    'zone.cannot.delete' => 'لا يمكن حذف المنطقة',
    'ok' => 'موافق',
    'add' => 'إضافة',

];
